{
	"sections": [
		{
			"title": "What I did.",
			"text": "I firstly arrived at the SafetyCulture office on Monday, the 25th of September, and was speedily introduced to my work experience supervisor, Tristan Davey. Cain Varoy, who would accompany me throughout my work experience, and who was also a Townsville Grammar School student, arrived shortly after, and we both began a tour of office. ‘Impressive’ is a mere understatement of what could only be described as the best workplace environment I had ever seen. A number of desks were neatly positioned to the right-hand side of the entrance, as well as a number of TVs on the wall, one of which had a countdown to Stranger Things Season 2 on it. Clocks displaying the various times around the world were positioned on the wall to the left. After being introduced to engineers, ranging from iOS and Android developers to web developers, we were escorted around the office to see the various other facilities, such as the basketball court with ping-pong tables, cafeteria-sque kitchen area and theatre (yes, <i>theatre</i>), as well as more desks which were positioned throughout the office (including the desks that both Cain and I would be working at).<br><br>Throughout the duration of the work experience, Cain and I completed a number of tasks assigned to us by Tristan, such as designing the interface for an undeveloped (to my knowledge) section of iAudtor, designing and creating a web interface that interacts with iAuditor’s public API, and writing this very webpage you’re reading right now. We also got the chance to have an inside look at the infrastructure of iAuditor and the mountain of micro services it uses to drive the service, as well as the video editing suite and its insane equipment (e.g. their 8K RED camera). Finally, we were also given the chance to view <i>The Hustle</i>, a short film produced by SafetyCulture’s CEO Luke Anear, discussing the struggles of pursuing a start-up company told through stories of three widely successful start-ups, including Luke’s own.<br><br>It was a pretty awesome week."
		},
		{
			"title": "What I learned.",
			"text": "I learned a countless number of things throughout my experience at SafetyCulture, from the importance of project management when it comes to large-scale companies like SafetyCulture, and the required structure for undertaking tasks. I also learned of the history of SafetyCulture through the documentary, <i>The Hustle</i>, and about the time and determination that is required to create a start-up of this calibre. In a more <i>literal</i> sense, I learned about the structure of software at the scale of iAuditor, and about the typical development workflow of the engineers within the company. I also experienced the iterative nature of design and development through the projects given to us by Tristan."
		},
		{
			"title": "My Personal Experience.",
			"text": "Participating in work experience at SafetyCulture has been one of the most fun and interesting experiences I’ve had so far. Not only has it helped me broaden my knowledge of the technology and safety industry, but it has also proved to be extremely fun in doing so. Completing the various activities alongside Cain, such as designing app interfaces and developing the audit summary system, went off without a hitch, and was extremely fun in the process. All of the staff at SafetyCulture, especially Tristan and Luke, are the nicest and most down-to-earth people that I have met. It was truly a great experience.<br> Oh, and I also got a free shirt.<br><br>It’s actually a really nice shirt."
		}
	]
}